Repository: mohamedna3eem/elevate_Super_Fitness
Catalog: lib/l10n/intl_*.arb
Languages: ar

# connectionTimeout
source: Connection timeout. Please try again later.
ar: انتهت مهلة الاتصال. يُرجى المحاولة لاحقًا.

# sendTimeout
source: Request timed out. Please try again.
ar: انتهت مهلة الطلب. يُرجى المحاولة مرة أخرى.

# receiveTimeout
source: Server took too long to respond.
ar: الخادم استغرق وقتًا طويلاً للرد.

# badCertificate
source: Bad certificate. Please check your device date/time.
ar: شهادة غير صالحة. تحقق من تاريخ ووقت جهازك.

# badResponse
source: Unexpected error response from server
ar: استجابة غير متوقعة من الخادم.

# noResponse
source: No response received from server.
ar: لم يتم استلام أي رد من الخادم.

# failedToParseResponse
source: Failed to parse error response.
ar: فشل في تحليل استجابة الخطأ.

# dioErrorCancel
source: Request was cancelled. Please retry.
ar: تم إلغاء الطلب. يُرجى إعادة المحاولة.

# connectionError
source: Network error. Please check your internet connection.
ar: خطأ في الاتصال. تحقق من اتصال الإنترنت.

# unknownError
source: An unexpected error occurred:
ar: حدث خطأ غير متوقع:

source: Unknown
ar: غير معروف

source: Location services are disabled.
ar: خدمات الموقع معطلة.

source: Location permission denied.
ar: تم رفض إذن الموقع.

source: Location permission permanently denied.
ar: تم رفض إذن الموقع بشكل دائم.

source: email is required
ar: البريد الإلكتروني مطلوب

source: enter valid email
ar: أدخل بريدًا إلكترونيًا صالحًا

source: password is required
ar: كلمة المرور مطلوبة

source: password Not Matched
ar: كلمتا المرور غير متطابقتين

source: This field is required
ar: هذا الحقل مطلوب

source: Enter valid username
ar: أدخل اسم مستخدم صالحًا

source: Enter numbers only
ar: أدخل أرقامًا فقط

source: Enter value must equal 11 digit
ar: يجب أن يحتوي الرقم على 11 رقمًا

source: Enter valid Egyptian Phone number
ar: أدخل رقم هاتف مصري صحيح

# pleaseEnterAddress
source: Please enter the address
ar: يُرجى إدخال العنوان

source: Please enter Valid Address
ar: يُرجى إدخال عنوان صالح

source: Ok
ar: حسنًا

source: No
ar: لا

source: Yes
ar: نعم

source: Loading...
ar: جارٍ التحميل...

# onBoarding1Title
source: The Price Of Excellence Is Discipline
ar: ثمن التميز هو الانضباط

# onBoarding2Title
source: Fitness Has Never Been So Much Fun
ar: اللياقة لم تكن ممتعة بهذا الشكل من قبل

# onBoarding3Title
source: NO MORE EXCUSES Do It Now
ar: لا مزيد من الأعذار، افعلها الآن

# onBoardingDesc
source: Lorem Ipsum Dolor Sit Amet Consectetur. Eu Urna Ut Gravida Quis Id Pretium Purus. Mauris Massa
ar: لوريم إيبسوم دولور سيت أميت كونسكتتور. يورنا جرافيدا كويز إد بريتيم بورس. موريس ماسا.

source: Skip
ar: تخطي

source: Next
ar: التالي

source: Back
ar: رجوع

source: Do IT
ar: ابدأ الآن

source: Explore
ar: استكشف

source: Smart Coach
ar: المدرب الذكي

source: Workouts
ar: التمارين

source: Profile
ar: الملف الشخصي

source: Hey There
ar: مرحبًا!

source: WELCOME BACK
ar: مرحبًا بعودتك

source: Login
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Forgot Password ?
ar: هل نسيت كلمة المرور؟

# doNotHaveAccountYet
source: Don't have an account Yet ?
ar: ليس لديك حساب بعد؟

source: Register
ar: إنشاء حساب

source: Or
ar: أو

source: Create an account
ar: أنشئ حسابًا

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

# alreadyHaveAccount
source: Already Have An Account?
ar: هل لديك حساب بالفعل؟

source: Tell us about yourself
ar: أخبرنا عن نفسك

source: We Need To Know Your Gender
ar: نحتاج لمعرفة جنسك

source: How old are you ?
ar: كم عمرك؟

source: This Helps Us Create Your Personalized Plan
ar: يساعدنا هذا في إنشاء خطة مخصصة لك

source: What is your weight ?
ar: ما هو وزنك؟

source: What is your height ?
ar: ما هو طولك؟

source: What is your goal ?
ar: ما هو هدفك؟

source: your regular physical activity level
ar: مستوى نشاطك البدني المعتاد

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Year
ar: سنة

source: Kg
ar: كجم

source: CM
ar: سم

source: Rookie
ar: مبتدئ جدًا

source: Beginner
ar: مبتدئ

source: Intermediate
ar: متوسط

source: Advance
ar: متقدم

source: True Beast
ar: محترف

source: Gain weight
ar: زيادة الوزن

source: Lose weight
ar: إنقاص الوزن

source: Get fitter
ar: تحسين اللياقة

source: Gain more flexible
ar: زيادة المرونة

source: Learn the basic
ar: تعلّم الأساسيات

source: Account created successfully
ar: تم إنشاء الحساب بنجاح

source: Lorem ipsum dolor sit amet consectetur. Tempus volutpat ut nisi morbi.
ar: لوريم إيبسوم دولور سيت أميت كونسكتتور. تيمبوس فولبتات نيسي موربي.

# min30
source: 30 MIN
ar: 30 دقيقة

# cal130
source: 130 Cal
ar: 130 سعرة حرارية

# numberOfExerciseGroups
source: 3 groups * 15 times
ar: 3 مجموعات × 15 مرة

source: Lorem ipsum dolor sit amet consectetur. Tempus
ar: لوريم إيبسوم دولور سيت أميت كونسكتتور.

# noExerciseAvailable
source: No Exercises Available
ar: لا توجد تمارين متاحة

source: Exercise
ar: تمرين

source: Chest Exercise
ar: تمارين الصدر

source: Video not available for this exercise.
ar: الفيديو غير متاح لهذا التمرين.

source: Category
ar: الفئة

source: Recommendation to day
ar: توصية اليوم

source: See all
ar: عرض الكل

source: Upcoming Workouts
ar: التمارين القادمة

source: Recommendation For You
ar: توصيات لك

source: Popular Training
ar: التمارين الشائعة

# letsStartYourDay
source: Letâ€™s start your day
ar: لنبدأ يومك

source: Hi
ar: مرحبًا

source: Gym
ar: صالة الألعاب الرياضية

source: Fitness
ar: اللياقة

source: Yoga
ar: اليوغا

source: Aerobics
ar: الأيروبيك

source: Trainer
ar: المدرب

source: I Am Your Smart Coach
ar: أنا مدربك الذكي

source: How Can I Assist You Today?
ar: كيف يمكنني مساعدتك اليوم؟

source: Get Started
ar: ابدأ

source: Message Smart Coach
ar: راسل المدرب الذكي

source: Smart Coach is typing...
ar: المدرب الذكي يكتب...

source: Previous Conversations
ar: المحادثات السابقة

source: No Conversations Yet
ar: لا توجد محادثات بعد

source: make sure its 8 characters or more
ar: تأكد أن كلمة المرور 8 أحرف أو أكثر

source: Create new password
ar: إنشاء كلمة مرور جديدة

source: Old Password
ar: كلمة المرور القديمة

source: Done
ar: تم

source: Food Recommendation
ar: توصيات غذائية

source: Ingredients
ar: المكونات

source: Recommendation
ar: التوصية

source: Show More
ar: عرض المزيد

source: Energy
ar: الطاقة

source: Protein
ar: البروتين

source: Carbs
ar: الكربوهيدرات

source: Fat
ar: الدهون

source: No Meals Available
ar: لا توجد وجبات متاحة

source: Forget password
ar: نسيت كلمة المرور

# enterYouEmail
source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Confirm
ar: تأكيد

source: email address
ar: عنوان البريد الإلكتروني

source: Email verification
ar: التحقق من البريد الإلكتروني

source: Please enter your code that send to your
ar: أدخل الرمز المرسل إلى بريدك الإلكتروني

source: email is correct
ar: البريد الإلكتروني صحيح

source: error
ar: خطأ

source: success
ar: نجاح

source: password Reset Successfully
ar: تم إعادة تعيين كلمة المرور بنجاح

source: invalidCode
ar: رمز غير صالح

source: Please enter your email associated to
ar: أدخل البريد الإلكتروني المرتبط بـ

source: your account
ar: حسابك

source: resetPassword
ar: إعادة تعيين كلمة المرور

# passwordMustNotEmpty
source: Password must not be empty and must contain 6 characters with upper case letter and one number at least
ar: يجب ألا تكون كلمة المرور فارغة ويجب أن تحتوي على 6 أحرف على الأقل وحرف كبير ورقم واحد على الأقل.

source: newPassword
ar: كلمة المرور الجديدة

source: enterYourPassword
ar: أدخل كلمة المرور

source: confirmPassword
ar: تأكيد كلمة المرور

source: Code verified successfully
ar: تم التحقق من الرمز بنجاح

source: Code is sent successfully
ar: تم إرسال الرمز بنجاح

# resend
source: Resend Code?
ar: إعادة إرسال الرمز؟

# didnotReceiveCode
source: didn't receive verification code?
ar: لم تستلم رمز التحقق؟

source: OTP CODE
ar: رمز التحقق (OTP)

source: Enter Your OTP Check Your Email
ar: أدخل رمز التحقق من بريدك الإلكتروني

# numberMustBeSixNumber
source: Number must be 6 number
ar: يجب أن يتكون الرقم من 6 أرقام

source: Sent OTP
ar: تم إرسال الرمز

source: Your Weight
ar: وزنك

source: Your Goal
ar: هدفك

source: Your activity level
ar: مستوى نشاطك

source: tap to edit
ar: اضغط للتعديل

source: Update
ar: تحديث

source: Logout
ar: تسجيل الخروج

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Edit Profile
ar: تعديل الملف الشخصي

source: Change Password
ar: تغيير كلمة المرور

source: Select Language
ar: اختيار اللغة

source: Security
ar: الأمان

source: Privacy Policy
ar: سياسة الخصوصية

source: Help
ar: المساعدة

# HelpAndSupport
source: Help & Support
ar: المساعدة والدعم

source: How can we help you today?
ar: كيف يمكننا مساعدتك اليوم؟

source: Get in Touch
ar: تواصل معنا

source: Email Support
ar: الدعم عبر البريد الإلكتروني

source: Get a response within 24 hours.
ar: احصل على رد خلال 24 ساعة.

source: Call Us
ar: اتصل بنا

source: Available 9 AM - 5 PM (PST).
ar: متاح من 9 صباحًا - 5 مساءً (بتوقيت المحيط الهادئ).

source: Frequently Asked Questions
ar: الأسئلة الشائعة

source: How does the AI Trainer 'Apex' work?
ar: كيف يعمل المدرب الذكي 'أبيكس'؟

# OurAITrainerApexUsesYourProvidedData
source: Our AI Trainer, 'Apex', uses your provided data (goals, weight, height) and performance (reps, sets) to build a custom workout plan. For form correction, it uses your phone's camera (with your permission) to analyze your movements in real-time and provide feedback.
ar: يستخدم مدربنا الذكي 'أبيكس' بياناتك المقدمة (الأهداف، الوزن، الطول) وأدائك (التكرارات، المجموعات) لبناء خطة تمرين مخصصة. لتصحيح الوضعية، يستخدم كاميرا هاتفك (بإذن منك) لتحليل حركاتك في الوقت الفعلي وتقديم ملاحظات.

source: How do I log a meal?
ar: كيف أسجل وجبة؟

# NavigateToTheNutritionTab
source: Navigate to the 'Nutrition' tab from the bottom menu. Tap the '+' button on the meal you wish to log (e.g., Breakfast, Lunch). You can then search our food database, scan a barcode, or enter the macros manually.
ar: انتقل إلى علامة التبويب 'التغذية' من القائمة السفلية. اضغط على زر '+' بجوار الوجبة التي ترغب في تسجيلها (مثل الإفطار، الغداء). يمكنك بعد ذلك البحث في قاعدة بيانات الأطعمة لدينا، أو مسح باركود، أو إدخال الماكروز يدويًا.

source: How do I manage my subscription?
ar: كيف أدير اشتراكي؟

# YouCanManageYourSubscription
source: You can manage your subscription by going to 'Profile' > 'Settings' > 'Manage Subscription'. From there, you can upgrade, downgrade, or cancel your plan. All billing is handled through the App Store or Google Play Store.
ar: يمكنك إدارة اشتراكك بالانتقال إلى 'الملف الشخصي' > 'الإعدادات' > 'إدارة الاشتراك'. من هناك، يمكنك ترقية أو تخفيض أو إلغاء خطتك. تتم جميع عمليات الفوترة من خلال متجر التطبيقات (App Store) أو متجر Google Play.

source: Is my video data for form correction private?
ar: هل بيانات الفيديو الخاصة بي لتصحيح الوضعية خاصة؟

# YesYourPrivacyIsOurPriority
source: Yes. Your privacy is our priority. The video stream for form correction is processed locally on your device or on our secure servers via AI. It is never viewed by humans without your explicit consent for support or troubleshooting. All analyzed data is anonymized.
ar: نعم. خصوصيتك هي أولويتنا. يتم معالجة بث الفيديو لتصحيح الوضعية محليًا على جهازك أو على خوادمنا الآمنة عبر الذكاء الاصطناعي. لا يطلع عليها أي شخص دون موافقتك الصريحة لأغراض الدعم أو استكشاف الأخطاء وإصلاحها. جميع البيانات التي يتم تحليلها تكون مجهولة الهوية.

source: Privacy Policy
ar: سياسة الخصوصية

source: Last Updated: November 1, 2025
ar: آخر تحديث: 1 نوفمبر 2025

# WelcomeToApexFitness
source: Welcome to Apex Fitness ('we,' 'us,' or 'our'). We are committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you use our mobile application.
ar: مرحبًا بكم في 'أبيكس فيتنس' ('نحن'، 'لنا'). نحن ملتزمون بحماية خصوصيتك. تشرح سياسة الخصوصية هذه كيف نجمع ونستخدم ونكشف ونحمي معلوماتك عند استخدامك لتطبيقنا على الهاتف المحمول.

# InformationWeCollect
source: 1. Information We Collect
ar: 1. المعلومات التي نجمعها

# PersonalDataYouProvide
source: A. Personal Data You Provide
ar: أ. البيانات الشخصية التي تقدمها

# WeCollectInformationYouProvideDirectly
source: We collect information you provide directly to us, such as when you create an account, log your meals, or contact customer support. This includes: - Name and Email Address - Profile Information (age, gender, weight, height) - Meal and activity logs
ar: نحن نجمع المعلومات التي تقدمها لنا مباشرة، مثل عند إنشاء حساب، أو تسجيل وجباتك، أو الاتصال بدعم العملاء. وهذا يشمل: - الاسم وعنوان البريد الإلكتروني - معلومات الملف الشخصي (العمر، الجنس، الوزن، الطول) - سجلات الوجبات والنشاط

# AITrainerAndHealthData
source: B. AI Trainer & Health Data
ar: ب. بيانات المدرب الذكي والصحة

# ToUseTheAITrainerYouMayProvideSensitiveData
source: To use the AI Trainer, you may provide sensitive data. This includes: - Fitness goals and preferences. - Photos or videos for form correction analysis (this data is processed by our AI and not viewed by humans without your explicit consent). - Performance data (reps, sets, weight lifted).
ar: لاستخدام المدرب الذكي، قد تقدم بيانات حساسة. وهذا يشمل: - أهداف اللياقة البدنية والتفضيلات. - الصور أو مقاطع الفيديو لتحليل تصحيح الوضعية (تتم معالجة هذه البيانات بواسطة الذكاء الاصطناعي لدينا ولا يطلع عليها أي شخص دون موافقتك الصريحة). - بيانات الأداء (التكرارات، المجموعات، الوزن المرفوع).

# AutomaticUsageData
source: C. Automatic Usage Data
ar: ج. بيانات الاستخدام التلقائية

# WeAutomaticallyCollectInformationAboutYourDevice
source: We automatically collect information about your device and how you use our app, such as device type, IP address, operating system, and crash logs.
ar: نحن نجمع تلقائيًا معلومات حول جهازك وكيفية استخدامك لتطبيقنا، مثل نوع الجهاز، وعنوان IP، ونظام التشغيل، وسجلات الأعطال.

# HowWeUseYourInformation
source: 2. How We Use Your Information
ar: 2. كيف نستخدم معلوماتك

# HowWeUseInfo1
source: To provide, maintain, and improve our services.
ar: لتقديم خدماتنا وصيانتها وتحسينها.

# HowWeUseInfo2
source: To personalize your experience, such as creating custom workout and meal plans.
ar: لتخصيص تجربتك، مثل إنشاء خطط تمارين ووجبات مخصصة.

# HowWeUseInfo3
source: To power the AI Trainer and provide form correction feedback.
ar: لتشغيل المدرب الذكي وتقديم ملاحظات تصحيح الوضعية.

# HowWeUseInfo4
source: To communicate with you, including sending service updates and marketing messages (which you can opt-out of).
ar: للتواصل معك، بما في ذلك إرسال تحديثات الخدمة والرسائل التسويقية (التي يمكنك إلغاء الاشتراك فيها).

# HowWeUseInfo5
source: To monitor and analyze trends, usage, and activities to improve app performance and security.
ar: لمراقبة وتحليل الاتجاهات والاستخدام والأنشطة لتحسين أداء التطبيق وأمانه.

# HowWeShareYourInformation
source: 3. How We Share Your Information
ar: 3. كيف نشارك معلوماتك

# HowWeShareInfo1
source: With third-party service providers (e.g., cloud hosting) who need access to such information to perform services for us, under strict confidentiality agreements.
ar: مع مزودي الخدمات من الأطراف الثالثة (مثل الاستضافة السحابية) الذين يحتاجون إلى الوصول إلى هذه المعلومات لأداء الخدمات لنا، بموجب اتفاقيات سرية صارمة.

# HowWeShareInfo2
source: If required by law, such as in response to a subpoena or legal process.
ar: إذا اقتضى القانون ذلك، كما هو الحال استجابةً لأمر استدعاء أو إجراء قانوني.

# HowWeShareInfo3
source: If we believe your actions are inconsistent with our user agreements or to protect the rights, property, and safety of Apex Fitness or others.
ar: إذا كنا نعتقد أن أفعالك غير متسقة مع اتفاقيات المستخدم الخاصة بنا أو لحماية حقوق وملكية وسلامة 'أبيكس فيتنس' أو الآخرين.

source: **We do not sell your personal or sensitive health data.**
ar: **نحن لا نبيع بياناتك الشخصية أو الصحية الحساسة.**

# DataSecurity
source: 4. Data Security
ar: 4. أمن البيانات

# WeImplementReasonableSecurityMeasures
source: We implement reasonable administrative, technical, and physical security measures to protect your information. This includes encryption of data in transit and at rest. However, no security system is impenetrable, and we cannot guarantee the absolute security of your information.
ar: نحن نطبق تدابير أمنية إدارية وتقنية ومادية معقولة لحماية معلوماتك. وهذا يشمل تشفير البيانات أثناء النقل وفي وضع السكون. ومع ذلك، لا يوجد نظام أمني لا يمكن اختراقه، ولا يمكننا ضمان الأمان المطلق لمعلوماتك.

# YourDataRights
source: 5. Your Data Rights
ar: 5. حقوق بياناتك

# DataRights1
source: You have the right to access the personal information we hold about you.
ar: لديك الحق في الوصول إلى المعلومات الشخصية التي نحتفظ بها عنك.

# DataRights2
source: You can correct, update, or request deletion of your personal information through your account settings or by contacting us.
ar: يمكنك تصحيح أو تحديث أو طلب حذف معلوماتك الشخصية من خلال إعدادات حسابك أو عن طريق الاتصال بنا.

# DataRights3
source: You may object to the processing of your data or request that we restrict processing in certain circumstances.
ar: يحق لك الاعتراض على معالجة بياناتك أو أن تطلب منا تقييد المعالجة في ظروف معينة.

# ChildrensPrivacy
source: 6. Children's Privacy
ar: 6. خصوصية الأطفال

# ChildrensPrivacyContent
source: Our app is not intended for individuals under the age of 16. We do not knowingly collect personal information from children under 16. If we become aware that we have, we will take steps to delete such information promptly.
ar: تطبيقنا غير مخصص للأفراد الذين تقل أعمارهم عن 16 عامًا. نحن لا نجمع عن عمد معلومات شخصية من الأطفال دون سن 16 عامًا. إذا علمنا أننا قمنا بذلك، فسنتخذ خطوات لحذف هذه المعلومات على الفور.

# ChangesToThisPolicy
source: 7. Changes to This Policy
ar: 7. التغييرات على هذه السياسة

# ChangesToThisPolicyContent
source: We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new policy in the app and updating the 'Last Updated' date. Your continued use of the app after changes constitutes your acceptance.
ar: قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. سنقوم بإعلامك بأي تغييرات عن طريق نشر السياسة الجديدة في التطبيق وتحديث تاريخ 'آخر تحديث'. استمرار استخدامك للتطبيق بعد التغييرات يشكل موافقتك.

# ContactUs
source: 8. Contact Us
ar: 8. تواصلوا معنا

# ContactUs1
source: If you have questions about this Privacy Policy, please contact us at:
ar: إذا كانت لديك أسئلة حول سياسة الخصوصية هذه، يرجى التواصل معنا على:

# ContactUsEmail
source: Email: privacy@apexfitness.com
ar: البريد الإلكتروني: privacy@apexfitness.com

# ContactUsAddress
source: Address: 123 Fitness Ave, San Francisco, CA 94105
ar: العنوان: 123 شارع فيتنس، سان فرانسيسكو، كاليفورنيا 94105

# UserRolesAndPermissions
source: User Roles & Permissions
ar: أدوار وصلاحيات المستخدمين

# ManageAccessAndCapabilities
source: Manage the access and capabilities of different user roles within the system.
ar: إدارة الوصول وقدرات أدوار المستخدمين المختلفة داخل النظام.

source: Available Roles
ar: الأدوار المتاحة

source: Super Admin
ar: المدير العام (سوبر أدمن)

# SuperAdminDescription
source: Full, unrestricted access to all system settings, user management, and content. This role is for system administrators only.
ar: وصول كامل وغير مقيد لجميع إعدادات النظام، وإدارة المستخدمين، والمحتوى. هذا الدور مخصص لمديري النظام فقط.

source: Modify System Configuration
ar: تعديل إعدادات النظام

# ModifySystemConfigurationDescription
source: Can change core application settings, including integrations and security policies.
ar: يمكنه تغيير إعدادات التطبيق الأساسية، بما في ذلك التكاملات والسياسات الأمنية.

source: Full User Management
ar: إدارة كاملة للمستخدمين

# FullUserManagementDescription
source: Can create, read, update, and delete any user, including other administrators.
ar: يمكنه إنشاء، قراءة، تحديث، وحذف أي مستخدم، بما في ذلك المدراء الآخرين.

source: Full Content Control
ar: تحكم كامل بالمحتوى

# FullContentControlDescription
source: Can create, edit, publish, and delete all content across the application.
ar: يمكنه إنشاء، تعديل، نشر، وحذف كل المحتوى عبر التطبيق.

# ManageBillingAndSubscriptions
source: Manage Billing & Subscriptions
ar: إدارة الفواتير والاشتراكات

# ManageBillingAndSubscriptionsDescription
source: Can access invoices, change payment methods, and manage subscription plans.
ar: يمكنه الوصول إلى الفواتير، تغيير طرق الدفع، وإدارة خطط الاشتراك.

source: User Manager
ar: مدير المستخدمين

# UserManagerDescription
source: Can manage non-admin users. This role is for team leads or HR personnel.
ar: يمكنه إدارة المستخدمين غير المدراء. هذا الدور مخصص لقادة الفرق أو موظفي الموارد البشرية.

source: Create Users
ar: إنشاء مستخدمين

# CreateUsersDescription
source: Can add new non-admin users to the system.
ar: يمكنه إضافة مستخدمين جدد (غير مدراء) إلى النظام.

source: Edit User Profiles
ar: تعديل ملفات المستخدمين

# EditUserProfilesDescription
source: Can update profile information and reset passwords for non-admin users.
ar: يمكنه تحديث معلومات الملف الشخصي وإعادة تعيين كلمات المرور للمستخدمين غير المدراء.

source: Delete/Deactivate Users
ar: حذف/إلغاء تنشيط المستخدمين

# DeleteDeactivateUsersDescription
source: Can remove or deactivate non-admin user accounts.
ar: يمكنه إزالة أو إلغاء تنشيط حسابات المستخدمين غير المدراء.

source: View User List
ar: عرض قائمة المستخدمين

# ViewUserListDescription
source: Can see the list of all non-admin users.
ar: يمكنه رؤية قائمة بجميع المستخدمين غير المدراء.

source: Content Editor
ar: محرر المحتوى

# ContentEditorDescription
source: Can create, edit, and publish content (e.g., articles, products), but cannot manage users or settings.
ar: يمكنه إنشاء، تعديل، ونشر المحتوى (مثل المقالات، المنتجات)، ولكن لا يمكنه إدارة المستخدمين أو الإعدادات.

source: Create Content
ar: إنشاء محتوى

# CreateContentDescription
source: Can create new drafts for articles, posts, or products.
ar: يمكنه إنشاء مسودات جديدة للمقالات أو المنشورات أو المنتجات.

source: Edit Own Content
ar: تعديل المحتوى الخاص به

# EditOwnContentDescription
source: Can edit content that they have created.
ar: يمكنه تعديل المحتوى الذي قام بإنشائه.

source: Publish Content
ar: نشر المحتوى

# PublishContentDescription
source: Can make content live and visible to the public.
ar: يمكنه جعل المحتوى متاحًا ومرئيًا للجمهور.

source: Upload Media
ar: رفع الوسائط

# UploadMediaDescription
source: Can upload images, videos, and documents to the media library.
ar: يمكنه رفع الصور ومقاطع الفيديو والمستندات إلى مكتبة الوسائط.

source: Viewer
ar: مشاهد

# ViewerDescription
source: Read-only access. Can view content and dashboards but cannot make any changes.
ar: وصول للقراءة فقط. يمكنه عرض المحتوى ولوحات المعلومات ولكن لا يمكنه إجراء أي تغييرات.

source: Read Content
ar: قراءة المحتوى

# ReadContentDescription
source: Can view all published content.
ar: يمكنه عرض كل المحتوى المنشور.

source: View Dashboards
ar: عرض لوحات المعلومات

# ViewDashboardsDescription
source: Can access and view analytics dashboards in read-only mode.
ar: يمكنه الوصول وعرض لوحات تحليلات المعلومات في وضع القراءة فقط.
